openfoam/turbulence_model_coefficients/version_1/baseCase_1/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application simpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 2000;

deltaT 1;

writeControl timeStep;

writeInterval 500;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
  squareU
  {
    type squareU;
    libs
      (
        "libsquareUFunctionObject.so"
      );
    writeControl timeStep;
    writeInterval 1;
  }
#includeFunc wallShearStress
} 	// ************************************************************************* //

