openfoam/turbulence_model_coefficients/version_1/baseCase_1/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
